# YOLOv9

# parameters
nc: 14  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
#activation: nn.LeakyReLU(0.1)
#activation: nn.ReLU()

# anchors
anchors: 3

# YOLOv9 backbone
backbone:
  [
   [-1, 1, Silence, []],

   # conv down
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2

   # conv down
   [-1, 1, Conv, [128, 3, 2]],  # 2-P2/4

   # csp-elan block
   [-1, 1, RepNCSPELAN4, [256, 128, 64, 2]],  # 3

   # avg-conv down
   [-1, 1, ADown, [256]],  # 4-P3/8

   # csp-elan block
   [-1, 1, RepNCSPELAN4, [512, 256, 128, 2]],  # 5
   [-1, 1, ContextAggregation, [512]],   #6

   # avg-conv down
   [-1, 1, ADown, [512]],  # 7-P4/16

   # csp-elan block
   [-1, 1, RepNCSPELAN4, [1024, 512, 256, 2]],  # 8
   [-1, 1, ContextAggregation, [1024]],  #9

   # avg-conv down
   [-1, 1, ADown, [1024]],  # 10-P5/32

   # csp-elan block
   [-1, 1, RepNCSPELAN4, [1024, 512, 256, 2]],  # 11
   [-1, 1, ContextAggregation, [1024]],   #12

   # routing
   [1, 1, CBLinear, [[64]]], # 13
   [3, 1, CBLinear, [[64, 128]]], # 14
   [6, 1, CBLinear, [[64, 128, 256]]], # 15
   [9, 1, CBLinear, [[64, 128, 256, 512]]], # 16
   [12, 1, CBLinear, [[64, 128, 256, 512, 1024]]], # 17

   # conv down
   [0, 1, Conv, [64, 3, 2]],  # 18-P1/2
   [[13, 14, 15, 16, 17, -1], 1, CBFuse, [[0, 0, 0, 0, 0]]], # 19

   # conv down
   [-1, 1, Conv, [128, 3, 2]],  # 20-P2/4
   [[14, 15, 16, 17, -1], 1, CBFuse, [[1, 1, 1, 1]]], # 18 21

   # csp-elan block
   [-1, 1, RepNCSPELAN4, [256, 128, 64, 2]],  # 22

   # avg-conv down fuse
   [-1, 1, ADown, [256]],  # 23-P3/8
   [[15, 16, 17, -1], 1, CBFuse, [[2, 2, 2]]], # 24

   # csp-elan block
   [-1, 1, RepNCSPELAN4, [512, 256, 128, 2]],  # 25

   # avg-conv down fuse
   [-1, 1, ADown, [512]],  # 26-P4/16
   [[16, 17, -1], 1, CBFuse, [[3, 3]]], # 27

   # csp-elan block
   [-1, 1, RepNCSPELAN4, [1024, 512, 256, 2]],  # 28

   # avg-conv down fuse
   [-1, 1, ADown, [1024]],  # 29-P5/32
   [[17, -1], 1, CBFuse, [[4]]], # 30

   # csp-elan block
   [-1, 1, RepNCSPELAN4, [1024, 512, 256, 2]],  # 31
  ]

# YOLOv9 head
head:
  [
   # multi-level auxiliary branch

   # elan-spp block
   [12, 1, SPPELAN, [512, 256]],  # 32

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 9], 1, Concat, [1]],  # cat backbone P4

   # csp-elan block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 2]],  # 35

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P3

   # csp-elan block
   [-1, 1, RepNCSPELAN4, [256, 256, 128, 2]],  # 38



   # main branch

   # elan-spp block
   [28, 1, SPPELAN, [512, 256]],  # 39

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 25], 1, Concat, [1]],  # cat backbone P4

   # csp-elan block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 2]],  # 42

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 22], 1, Concat, [1]],  # cat backbone P3

   # csp-elan block
   [-1, 1, RepNCSPELAN4, [256, 256, 128, 2]],  # 45 (P3/8-small)

   # avg-conv-down merge
   [-1, 1, ADown, [256]],
   [[-1, 39], 1, Concat, [1]],  # cat head P4

   # csp-elan block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 2]],  # 48 (P4/16-medium)

   # avg-conv-down merge
   [-1, 1, ADown, [512]],
   [[-1, 36], 1, Concat, [1]],  # cat head P5

   # csp-elan block
   [-1, 1, RepNCSPELAN4, [512, 1024, 512, 2]],  # 51 (P5/32-large)

   # detect
   [[35, 32, 29, 42, 45, 48], 1, DualDDetect, [nc]],  # DualDDetect(A3, A4, A5, P3, P4, P5)
  ]
