# YOLOv9

# parameters
nc: 14  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
#activation: nn.LeakyReLU(0.1)
#activation: nn.ReLU()

# anchors
anchors: 3

# YOLOv9 backbone
backbone:
  [
   [-1, 1, Silence, []],

   # conv down
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2

   # conv down
   [-1, 1, Conv, [128, 3, 2]],  # 2-P2/4

   # elan-1 block
   [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]],  # 3

   # avg-conv down
   [-1, 1, ADown, [256]],  # 4-P3/8

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 256, 128, 1]],  # 5
   [-1, 1, Eca_layer, [512, 3]],  #6

   # avg-conv down
   [-1, 1, ADown, [512]],  # 7-P4/16

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 8
   [-1, 1, Eca_layer, [512, 3]],  #9

   # avg-conv down
   [-1, 1, ADown, [512]],  # 10-P5/32

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 11
   [-1, 1, Eca_layer, [512, 3]],  #12
  ]

# YOLOv9 head
head:
  [
   # elan-spp block
   [-1, 1, SPPELAN, [512, 256]],  # 13

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 9], 1, Concat, [1]],  # cat backbone P4

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 16

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P3

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]],  # 19 (P3/8-small)
   [-1, 1, Eca_layer, [512, 3]],#20

   # avg-conv-down merge
   [-1, 1, ADown, [256]],
   [[-1, 16], 1, Concat, [1]],  # cat head P4

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 23 (P4/16-medium)
   [-1, 1, Eca_layer, [512, 3]],#24

   # avg-conv-down merge
   [-1, 1, ADown, [512]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 27 (P5/32-large)
   [-1, 1, Eca_layer, [512, 3]],#28


   # multi-level reversible auxiliary branch

   # routing
   [6, 1, CBLinear, [[256]]], # 29
   [9, 1, CBLinear, [[256, 512]]], # 30
   [12, 1, CBLinear, [[256, 512, 512]]], # 31

   # conv down
   [0, 1, Conv, [64, 3, 2]],  # 26-P1/2

   # conv down
   [-1, 1, Conv, [128, 3, 2]],  # 27-P2/4

   # elan-1 block
   [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]],  # 34

   # avg-conv down fuse
   [-1, 1, ADown, [256]],  # 29-P3/8
   [[29, 30, 31, -1], 1, CBFuse, [[0, 0, 0]]], # 36

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 256, 128, 1]],  # 37
   [-1, 1, Eca_layer, [512, 3]],  #38

   # avg-conv down fuse
   [-1, 1, ADown, [512]],  # 33-P4/16
   [[30, 31, -1], 1, CBFuse, [[1, 1]]], # 40

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 41
   [-1, 1, Eca_layer, [512, 3]],  #42

   # avg-conv down fuse
   [-1, 1, ADown, [512]],  # 43-P5/32
   [[31, -1], 1, CBFuse, [[2]]], # 44

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 45
   [-1, 1, Eca_layer, [512, 3]],  #46



   # detection head

   # detect
   [[38, 42, 46, 20, 24, 28], 1, DualDDetect, [nc]],  # DualDDetect(A3, A4, A5, P3, P4, P5)
  ]
